{
   "dependencies": [],
   "content_type": "MISC",
   "title": "EFB MSFS2024 VfrNav",
   "manufacturer": "",
   "creator": "alex-home",
   "minimum_game_version": "1.3.23",
   "minimum_compatibility_version": "3.19.0.47",
   "builder": "Microsoft Flight Simulator 2024",
   "package_order_hint": "UI_PATCH",
   "release_notes": [
      {
         "version": "0.1.1",
         "date": "JANUARY 5, 2025",
         "notes": [
            "***🔧 Improvements / Améliorations:***",
            "  - Enhanced text overlay readability on the map / Amélioration de la lisibilité du texte affiché sur la carte.",
            "  - Automatically hide layers when their min/max zoom levels are reached / Les layers sont maintenant masqués lorsque leurs niveaux de zoom minimum ou maximum sont atteints.",
            "",
            "***🐞 Fixes / Corrections:***",
            "  - Drag & Drop no longer triggers on mouse clicks / Le Drag & Drop n'est plus déclenché lors des clics.",
            "  - Font loading issue resolved, improving text display quality / Correction du chargement des polices, améliorant l'affichage du texte.",
            "  - Fixed glitches occurring when hovering over navigation item labels / Correction des glitches lors du survol des labels des éléments de navigation."
         ]
      },
      {
         "version": "0.1.2",
         "date": "JANUARY 21, 2025",
         "notes": [
            "***🔧 Improvements / Améliorations:***",
            "  - General performance enhancements / Amélioration globale des performances.",
            "",
            "***🐞 Fixes / Corrections:***",
            "  - Resolved scrollbar glitches / Correction des anomalies liées à la barre de défilement."
         ]
      },
      {
         "version": "0.2.0",
         "date": "JANUARY 26, 2025",
         "notes": [
            "***🔧 Improvements / Améliorations:***",
            "  - Optimized overall performance / Optimisation des performances générales.",
            "  - Added preliminary support for PDF files (preview version) / Ajout du support des fichiers PDF (version préliminaire).",
            "  - Introduced new settings for enabling or disabling layers / Ajout de paramètres permettant l'activation ou la désactivation des layers."
         ]
      },
      {
         "version": "0.2.1",
         "date": "FEBRUARY 1, 2025",
         "notes": [
            "***🔧 Improvements / Améliorations:***",
            "  - Added settings for display customization / Ajout de paramètres permettant la personnalisation de l'affichage.",
            "  - Made settings persistent across simulator loads / Paramètres désormais conservés entre les chargements du simulateur.",
            "  - Automatically close navigation menu when drawing navigation legs / Fermeture automatique du menu de navigation lors du tracé des branches.",
            "  - General performance enhancements / Amélioration globale des performances."
         ]
      },
      {
         "version": "0.2.2",
         "date": "FEBRUARY 5, 2025",
         "notes": [
            "***🔧 Improvements / Améliorations:***",
            "  - General performance enhancements / Amélioration globale des performances.",
            "",
            "***🐞 Fixes / Corrections:***",
            "  - Resolved app crash issue when loading multiple documents / Correction du crash de l'application lors du chargement de plusieurs documents.",
            "  - Improved detection and loading of PDF fonts / Optimisation de la détection et du chargement des polices pour les fichiers PDF."
         ]
      },
      {
         "version": "0.3.0",
         "date": "FEBRUARY 9, 2025",
         "notes": [
            "***🔧 Improvements / Améliorations:***",
            "  - Removed OACI map's white background for a clearer display / Suppression du fond blanc de la carte OACI pour un affichage plus net.",
            "  - Added AZBA layer support / Ajout du layer AZBA.",
            "  - Introduced buttons for zooming in and out of PDFs / Ajout de boutons permettant de zoomer sur les fichiers PDF.",
            "  - Added zoom level customization settings for layers / Ajout de paramètres pour régler le niveau de zoom des layers.",
            "  - General performance enhancements / Amélioration globale des performances."
         ]
      },
      {
         "version": "0.3.1",
         "date": "FEBRUARY 16, 2025",
         "notes": [
            "***🐞 Fixes / Corrections:***",
            "  - Corrected navigation leg headings (0° for north) / Correction de l'orientation des branches de navigation (0° au nord).",
            "  - Fixed navigation leg time display / Correction de l'affichage des heures des branches de navigation."
         ]
      },
      {
         "version": "0.3.2",
         "date": "FEBRUARY 17, 2025",
         "notes": [
            "***🐞 Fixes / Corrections:***",
            "  - Corrected navigation leg distance calculations / Correction des calculs de distances des branches de navigation."
         ]
      },
      {
         "version": "0.3.3",
         "date": "FEBRUARY 24, 2025",
         "notes": [
            "***🔧 Improvements / Améliorations:***",
            "  - Set the app as a favorite by default / Forçage de l'application à être marquée comme favorite.",
            "",
            "***🐞 Fixes / Corrections:***",
            "  - Resolved MSFS native slider bug / Correction du bug des sliders natifs MSFS."
         ]
      },
      {
         "version": "0.4.0",
         "date": "MARCH 17, 2025",
         "notes": [
            "***🔧 Improvements / Améliorations:***",
            "  - Added an Airports layer displaying METAR, frequency, and additional information / Ajout d'un layer affichant les aéroports avec des informations sur les METARs, fréquences, etc.",
            "  - Integrated OpenFlightMap layer support / Ajout du layer OpenFlightMap.",
            "  - Introduced an option to display aircraft on the map (must be enabled in the settings page) / Ajout de la possibilité de voir la position de l'avion (doit être activé dans la page des paramètres).",
            "  - Added a new page for viewing flight and touchdown records / Ajout d'une page permettant d'afficher les enregistrements de vols et d'atterrissages.",
            "",
            "***🐞 Fixes / Corrections:***",
            "  - Prevented settings from resetting across updates / Empêche la réinitialisation des paramètres entre les mises à jour."
         ]
      },
      {
         "version": "0.4.1",
         "date": "MARCH 19, 2025",
         "notes": [
            "***🔧 Improvements / Améliorations:***",
            "  - Added an option to hide ground level on the flight record layer / Ajout de la possibilité de masquer le niveau du sol sur le layer d'enregistrement des vols.",
            "",
            "***🐞 Fixes / Corrections:***",
            "  - Ensured touchdown labels are always displayed above recorded flight paths / Affichage forcé des labels de touchdown au-dessus des chemins d'enregistrement de vol.",
            "  - Optimized memory usage for flight recording / Optimisation de l'utilisation de la mémoire pour l'enregistrement des vols.",
            "  - Fixed encoding issues in tab labels on the airport info popup / Correction des problèmes d'encodage des labels des onglets de la popup d'information des aéroports."
         ]
      },
      {
         "version": "1.0.0",
         "date": "MAY 25, 2025",
         "notes": [
            "### ALL ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Menu items adjust to DPI settings / Les éléments du menu s'adaptent aux paramètres DPI",
            "",
            "***🐞 Fixes / Corrections:***",
            "     - SU12: Application malfunction / SU12: Dysfonctionnement de l'application",
            "",
            "",
            "### Installer/Server (new) ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Added the ability to load PDF files from the computer / Ajout de la possibilité de charger des fichiers PDF depuis le PC.",
            "     - Added functionality to open the EFB directly from the app, enhancing preflight and postflight navigation / Ajout de la fonctionnalité permettant d'ouvrir l'EFB directement depuis l'application, améliorant la navigation pré et post vol.",
            "",
            "",
            "### EFB ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Increased text size in AZBA and airport information popups / Augmentation de la taille du texte des popups AZBA et des informations sur les aéroports.",
            "     - Enhanced the visual presentation of AZBA and airport information popups / Amélioration de la présentation des popups AZBA et des informations sur les aéroports."
         ]
      },
      {
         "version": "1.0.1",
         "date": "MAY 26, 2025",
         "notes": [
            "### EFB ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Show server status on the \"local\" tab of the PDF popup / Afficher le statut du serveur sur l'onglet \"local\" du popup PDF.",
            "     - Fix validation of the SIA input field / Corriger la validation du champ SIA."
         ]
      },
      {
         "version": "1.1.0",
         "date": "MAY 27, 2025",
         "notes": [
            "### Installer/Server (new) ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Enable the option to upload navigation data from the app to the EFB / Ajoute la possibilité de synchroniser les données de navigation de l'application vers l'EFB",
            "     - General bug fixes / Correction de bugs"
         ]
      },
      {
         "version": "1.2.0",
         "date": "JUN 15, 2025",
         "notes": [
            "### EFB ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Add OpenAPI Layer (preview; performance is not optimized, there are some glitches) / Ajout du layer OpenAPI (aperçu; les performances ne sont pas optimisées, possède quelques glitches)."
         ]
      },
      {
         "version": "1.3.0",
         "date": "JUL 6, 2025",
         "notes": [
            "### EFB ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Move \"Record settings\" to a new bottom toolbar / Paramètres de records déplacés dans une nouvelle barre d’outils en bas de l'EFB.",
            "     - Enable mouse wheel interaction for sliders / Interaction avec la molette de la souris ajoutée pour les curseurs.",
            "     - Added Navlog / Ajout d'un Navlog.",
            "     - Added a search bar to locate airports / Ajout d’une barre de recherche pour localiser les aéroports.",
            "",
            "",
            "### Installer/Server (new) ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Port now sent to EFB via SimConnect / Le port est désormais transmis à l’EFB via SimConnect.",
            "",
            "***🐞 Fixes / Corrections:***",
            "     - Memory leak resolved — Segfault fix / Fuite de mémoire corrigée — Résolution d'un Segfault."
         ]
      },
      {
         "version": "1.3.1",
         "date": "JUL 13, 2025",
         "notes": [
            "### EFB ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Automatically adjust font and icon sizes based on DPI changes / Ajuste dynamiquement la taille des polices et des icônes selon les changements de DPI.",
            "",
            "***🐞 Fixes / Corrections:***",
            "     - Correct label positioning when adding a waypoint—new labels are now inserted at the correct index instead of appended at the end / Correction de la position des labels lors de l’ajout d’un point de navigation : les nouveaux labels sont maintenant insérés à l’index courant, et non ajoutés à la fin.",
            "     - Fixed crash when deleting the final waypoint / Correction du crash survenant lors de la suppression du dernier point de navigation.",
            "",
            "",
            "### Installer/Server (new) ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Added support for exporting PDF charts from the app to the embedded EFB / Ajout de la possibilité d’exporter des cartes PDF depuis l’application vers l’EFB intégré."
         ]
      },
      {
         "version": "1.3.2",
         "date": "JUL 14, 2025",
         "notes": [
            "### EFB ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Enhanced display of SIA/airport information pop-ups for better readability and user interaction.",
            "       Amélioration de l'affichage des fenêtres contextuelles d'information SIA/aéroport pour une meilleure lisibilité et interaction utilisateur.",
            "     - Integrated option to download chart PDFs directly from the SIA source within airport information pages.",
            "       Ajout de l'option permettant de télécharger les cartes PDF directement depuis la source SIA via les pages d'information aéroport.",
            "",
            "***🐞 Fixes / Corrections:***",
            "     - Resolved issue with incorrect timezone and summer time settings for AZBA.",
            "       Correction du problème lié au fuseau horaire et à l'heure d'été incorrects pour AZBA."
         ]
      },
      {
         "version": "1.4.0",
         "date": "AUG 04, 2025",
         "notes": [
            "### EFB ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Enhanced display of Records layer (now in 3D).",
            "       Amélioration de l'affichage des enregistrement de vols (maintenant en 3D).",
            "     - Optimize Records layer performance.",
            "       Amélioration des performances du layer d'enregistrement de vols.",
            "     - Add measurement rules to Records layer.",
            "       Ajout de règles de mesure pour le layer des enregistrement de vols.",
            "",
            "***🐞 Fixes / Corrections:***",
            "     - Restore ICAO search bar suggestions.",
            "       Restore les suggestion de la bar de recherche ICAO."
         ]
      },
      {
         "version": "1.4.1",
         "date": "AUG 04, 2025",
         "notes": [
            "### EFB ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Add map rotation support to records layer (alt+shift+drag for rotation).",
            "       Ajout du support de la rotation de la map au layer d'enregistrement de vols (alt+shift+drag pour la rotation).",
            "     - Add the option to offset records on records layer.",
            "       Ajout de la possibilité de shifter les records sur le layer d'enregistrement de vols."
         ]
      },
      {
         "version": "1.4.2",
         "date": "AUG 05, 2025",
         "notes": [
            "### EFB ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Add map rotation support to navigation layer (alt+shift+drag for rotation).",
            "       Ajout du support de la rotation de la map au layer de navigation (alt+shift+drag pour la rotation).",
            "     - Improve flight recording layer display.",
            "       Amélioration de l'affichage du layer d'enregistrement de vols."
         ]
      },
      {
         "version": "1.4.3",
         "date": "AUG 05, 2025",
         "notes": [
            "### EFB ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Added slope option to record layer rules.",
            "       Ajout d'une option de pente aux règles du layer d'enregistrement de vols.",
            "     - Enhanced toolbar display for the record layer.",
            "       Amélioration de l'affichage de la barre d'outils du layer d'enregistrement de vols.",
            "     - New option to display partial records in the record layer.",
            "       Ajout de la possibilité d'afficher uniquement une partie du record dans le layer d'enregistrement de vols."
         ]
      },
      {
         "version": "1.4.4",
         "date": "AUG 06, 2025",
         "notes": [
            "### EFB ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Record rules are now relative to profile offset.",
            "       Les règles du layer d'enregistrement de vols sont désormais relatives à l'offset du profil.",
            "     - ATA is now auto-filled during leg validation.",
            "       Le champ ATA est désormais automatiquement rempli lors de la validation d'une étape de navigation.",
            "     - Option to populate fuel/departure time from aircraft, current system time.",
            "       Ajout de la possibilité de remplir les champs fuel/heure de départ à partir des valeurs actuelles de l'avion, de l'heure système.",
            "     - Scrollbar accessibility enhanced.",
            "       Amélioration de l'accessibilité des barres de défilement.",
            "     - Option to hide waypoint labels in navlog for better readability.",
            "       Ajout de la possibilité de masquer les labels de waypoints dans la page de navlog pour améliorer la lisibilité.",
            "",
            "***🐞 Fixes / Corrections:***",
            "     - ATA color (red/green) now displays correctly around midnight.",
            "       Correction de l'affichage de la couleur du champ ATA (rouge/vert) aux alentours de minuit."
         ]
      },
      {
         "version": "1.4.5",
         "date": "AUG 07, 2025",
         "notes": [
            "### EFB ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Display Navlog waypoints, remarks & altitude directly on the map.",
            "       Affichage des waypoints, remarques & altitudes du Navlog directement sur la carte.",
            "",
            "***🐞 Fixes / Corrections:***",
            "     - Correct heading and distance calculations that were affected by map rotation.",
            "       Correction des calculs de cap et de distance influencés par la rotation de la carte."
         ]
      },
      {
         "version": "1.4.6",
         "date": "AUG 07, 2025",
         "notes": [
            "### EFB ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Leg labels now remain within the visible viewport.",
            "       Les libellés des segments restent désormais visibles dans la zone d’affichage.",
            "",
            "***🐞 Fixes / Corrections:***",
            "     - Installer modified to prevent false Antivirus alerts.",
            "       Installateur modifié pour éviter les fausses alertes d'antivirus.",
            "     - Fixed data mismatch between Navlog and legs when path coordinates extend beyond the visible screen.",
            "       Correction du décalage entre les données du Navlog et celles des segments lorsque certaines coordonnées dépassent la zone d'affichage."
         ]
      },
      {
         "version": "1.5.0",
         "date": "AUG 09, 2025",
         "notes": [
            "### Installer/Server (new) ###",
            "***🔧 Improvements / Améliorations:***",
            "     - The web server is now connected to MSFS. Please refer to the README for instructions on accessing it from an external device.",
            "       Le serveur web est désormais connecté à MSFS. Veuillez consulter le fichier README pour savoir comment y accéder depuis un appareil externe",
            "",
            "",
            "### EFB ###",
            "***🐞 Fixes / Corrections:***",
            "     - Fixed data mismatch between Navlog and legs when path coordinates extend beyond the visible screen.",
            "           (This issue was previously marked as resolved... It is now properly fixed.)",
            "       Correction du décalage entre les données du Navlog et celles des segments lorsque certaines coordonnées dépassent la zone d'affichage.",
            "           (Ce problème avait été indiqué comme corrigé précédemment... Il est désormais réellement résolu.)"
         ]
      },
      {
         "version": "1.5.1",
         "date": "AUG 09, 2025",
         "notes": [
            "### Installer/Server (new) ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Server and EFB status now displayed on the EFB map.",
            "       Statut du serveur et de l’EFB désormais affichés sur la carte EFB",
            "",
            "***🐞 Fixes / Corrections:***",
            "     - General stability improvements.",
            "       Amélioration générale de la stabilité.",
            "",
            "",
            "### EFB ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Viewpoint selector (streetman) now appears above each element to ensure it remains selectable.",
            "       Le sélecteur de point de vue (streetman) s’affiche désormais au-dessus de chaque élément pour éviter qu’il ne devienne inaccessible.",
            "     - Minor display enhancements.",
            "       Améliorations mineures de l’affichage.",
            "",
            "***🐞 Fixes / Corrections:***",
            "     - Leg label was not always visible at low zoom levels.",
            "       Les labels de navigations n’étaient pas toujours visibles pour un niveau de zoom faible."
         ]
      },
      {
         "version": "1.5.2",
         "date": "AUG 09, 2025",
         "notes": [
            "### EFB ###",
            "***🐞 Fixes / Corrections:***",
            "     - Navlog: Loaded fuel is no longer modified during leg validation.",
            "       Le carburant chargé n'est plus modifié lors de la validation des étapes dans le Navlog."
         ]
      },
      {
         "version": "1.5.3",
         "date": "AUG 09, 2025",
         "notes": [
            "### EFB ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Removed black background on OpenFlightMap layer.",
            "       Suppression du fond noir sur le calque OpenFlightMap.",
            "",
            "***🐞 Fixes / Corrections:***",
            "     - Corrected fuel handling in the navigation log.",
            "       Correction de la gestion du carburant dans le log de navigation.",
            "     - Restored OpenFlightMap layer.",
            "       Restauration du calque OpenFlightMap."
         ]
      },
      {
         "version": "1.6.0",
         "date": "AUG 23, 2025",
         "notes": [
            "### Installer/Server (new) ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Added support for importing/exporting navlog and compass deviation/fuel consumption curves from/to file.",
            "       Ajout de la possibilité d'importer/exporter le navlog et les courbes de déviation/consommation de carburant vers/depuis un fichier.",
            "",
            "",
            "### EFB ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Added ability to save compass deviation and fuel consumption curves as presets.",
            "       Ajout de la possibilité d'enregistrer les courbes de déviation du compas et de consommation de carburant comme preset.",
            "     - Enhanced fuel flow calculations by factoring in altitude, temperature (and thrust - not yet implemented).",
            "       Amélioration du calcul du débit de carburant en tenant compte de l'altitude, la température (et du régime moteur - pas encore implémenté).",
            "     - Improved deviation curve chart visualization.",
            "       Amélioration de l'affichage du graphique des courbes de déviation.",
            "",
            "***🐞 Fixes / Corrections:***",
            "     - Resolved button sizing issue on the navdata page in MSFS EFB.",
            "       Correction de la taille des boutons sur la page des données de navigation dans l'EFB MSFS."
         ]
      },
      {
         "version": "1.6.1",
         "date": "AUG 23, 2025",
         "notes": [
            "### Installer/Server (new) ###",
            "***🐞 Fixes / Corrections:***",
            "     - The installer now correctly handles the Community folder, which was previously wiped.",
            "       Le programme d'installation gère désormais correctement le dossier Community, qui était auparavant supprimé."
         ]
      },
      {
         "version": "1.6.2",
         "date": "AUG 24, 2025",
         "notes": [
            "### Installer/Server (new) ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Always ask permission before removing a file or folder.",
            "       Demande systématique de confirmation avant la suppression d’un fichier ou dossier.",
            "",
            "",
            "### EFB ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Deactivated navigation paths are no longer selectable on the map.",
            "       Les trajectoires de navigation désactivées ne sont plus sélectionnables sur la carte.",
            "",
            "***🐞 Fixes / Corrections:***",
            "     - Resolved performance issue on the navlog page when hovering over the embedded EFB of MSFS.",
            "       Problème de performance résolu sur la page navlog lors du survol de l’EFB intégré de MSFS."
         ]
      },
      {
         "version": "1.7.0",
         "date": "AUG 31, 2025",
         "notes": [
            "### Installer/Server (new) ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Use a save dialog instead of a download dialog for navlog import.",
            "       Utilise une boîte de dialogue d'enregistrement au lieu d'une boîte de téléchargement pour l'importation du navlog.",
            "",
            "",
            "### EFB ###",
            "***🔧 Improvements / Améliorations:***",
            "     - Add the possibility to chain nav logs.",
            "       Ajoute la possibilité d'enchaîner les journaux de navigation.",
            "     - Add the possibility to enter floating values for variation.",
            "       Ajoute la possibilité de saisir des valeurs décimales pour la variation."
         ]
      }
   ]
}